In [1]:
import numpy as np
import pandas as pd

from datetime import datetime

In [3]:
myyear =2023
mymonth= 1
myday = 1
myhour = 12 
mymin = 0
mysec =10

In [4]:
mydate = datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [5]:
mydate

datetime.datetime(2023, 1, 1, 12, 0, 10)

In [7]:
data = pd.Series(['Nov 3, 1990','25-June 2002',None])

In [8]:
data #still a string object not date yet

0     Nov 3, 1990
1    25-June 2002
2            None
dtype: object

In [16]:
timeseries = pd.to_datetime(data) #turned into date time format #IMP

In [17]:
timeseries

0   1990-11-03
1   2002-06-25
2          NaT
dtype: datetime64[ns]

In [18]:
timeseries[0].year

1990

In [19]:
timeseries[1].month

6

In [20]:
#european date vs american date
euro_date = '10-12-2002'

In [25]:
pd.to_datetime(euro_date,dayfirst=True) #here now we get european format date

Timestamp('2002-12-10 00:00:00')

In [37]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [32]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [42]:
 sales['DATE'] = pd.to_datetime(sales['DATE'])

In [41]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [44]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [46]:
sales['DATE'] #now DATE colum turned into date

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [52]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0]) #directly in date format

In [51]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [61]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [62]:
sales = sales.set_index('DATE')

In [58]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [ ]:
sales.resample(rule='A').mean()

In [71]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [75]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [77]:
sales['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [78]:
sales['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64